# Ultralytics 🚀 AGPL-3.0 License
# YOLOv5s + Selective PEA + APDC

# Parameters
nc: 80
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10, 13, 16, 30, 33, 23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]

# Backbone
backbone: [
    # ---- Shallow layers ----
    [-1, 1, Conv, [64, 6, 2, 2]], # 0 - P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1 - P2/4
    [-1, 1, C3_PEA, [128]], # 2 - ✅ Selective PEA (shallow)

    # ---- Mid-level layers ----
    [-1, 1, Conv, [256, 3, 2]], # 3 - P3/8
    [-1, 6, C3, [256]], # 4 - Standard C3
    [-1, 1, APDC, [256]], # 5 - ✅ APDC (mid-level, standalone)

    # ---- Deep layers ----
    [-1, 1, Conv, [512, 3, 2]], # 6 - P4/16
    [-1, 9, C3, [512]], # 7
    [-1, 1, Conv, [1024, 3, 2]], # 8 - P5/32
    [-1, 3, C3, [1024]], # 9
    [-1, 1, SPPF, [1024, 5]], # 10
  ]

# Head (UNCHANGED)
head:
  [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, C3, [512, False]],

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C3, [256, False]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]],
    [-1, 3, C3, [512, False]],

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]],
    [-1, 3, C3, [1024, False]],

    [[17, 20, 23], 1, Detect, [nc, anchors]],
  ]
